docs/how-to-modify-website.md

# Table of Contents

-   [Academic Website Template](#org56b0b7c)
    -   [Note about modifying your website](#org7d88a23)
    -   [Other useful resources](#orgf53b4e7)


<a id="org56b0b7c"></a>

# Academic Website Template


<a id="org7d88a23"></a>

## Note about modifying your website

There are two ways to modify your website. Each has pros and 
cons and require using different tools. You should make you decision
based on how comfortable you feel with the tools required for 
each option, but most importantly, how likely you are to use
them for other things. It may not be useful to learn a new tool
if you're only going to use it once. 

The two options are using GitHub's webpage or using Git locally. I
discuss them very briefly below to help you make your decision.

-   Modify the website online

    You can use Github's webpage to modify your website. This is
    the easiest method and may very well suit your needs. You won't have 
    to install additional software and can modify your website from any
    computer or device (e.g., tablet) without worrying much about anything
    else. However, you won't be able to preview the changes to your website
    before making them public. 
    
    If you don't know what Git is or you are not interested in programming,
    then this may be the best option for you.

-   Modify the website on your computer

    This option requires installing a few software and learning to use 
    them. You will also need to learn to use a 
    text editor (e.g., [spacemacs](https://www.spacemacs.org/) [my favorite :) ], [vim](https://www.vim.org/), [atom](https://atom.io/), [notepad](https://notepad-plus-plus.org/))
    
    This requires installing the following software:
    
    -   [Ruby](https://www.ruby-lang.org/en/documentation/installation/)
    -   [Jekyll](https://jekyllrb.com/docs/)
    -   [Git](https://git-scm.com/book/en/v2/Getting-Started-Installing-Git)
    -   Text editor (many computers have at least one installed by default)
    
    After you have installed the required software, you need to [Clone](https://guides.github.com/activities/forking/#clone) this
    repo to your computer. You should now be able to modify add content
    to your website.
    
    After making changes, preview them on your local computer following this
    [guide](https://jekyllrb.com/docs/). To make your changes public, you have to push them to GitHub using
    Git.


<a id="orgf53b4e7"></a>

## Other useful resources

-   [Create your Academic Website in Jekyll and Host it on Github](http://svmiller.com/blog/2015/08/create-your-website-in-jekyll/)

